app/Http/Controllers/Warehouse/UnitController.php

    public function show(Request $request)
    {
        $units = Unit::where('product_units.product_id',$request->id)
            ->join('product_units', 'units.id', '=', 'product_units.unit_id')
            ->join('products', 'product_units.product_id', '=', 'products.id')
            // ->select('units.*','product_units.unit_type','products.rate')
            ->select('units.*','product_units.*')

            ->get();
---
select `units`.*, `product_units`.* from `units` inner join `product_units` on `units`.`id` = `product_units`.`unit_id` inner join `products` on `product_units`.`product_id` = `products`.`id` where `product_units`.`product_id` = '51'