app/Services/DailyStockService.php

    public function daily()
    {

        $daily = new Daily();
        $daily->daily_date = $this->core->data['date'];
        $daily->total = $this->core->data['grand_total'];
        $daily->save();
---
insert into `dailies` (`daily_date`, `total`, `updated_at`, `created_at`) values ('2024-05-18', 150, '2024-05-18 15:17:24', '2024-05-18 15:17:24')

    public function data_daily_detail()
    {



        $this->core->dailyDetailId_item['daily_id'] = $this->core->daily_id;
        $this->core->dailyDetailId_item['account_id'] = $this->core->account_id;
        $dailyDetailId =  DailyDetail::create($this->core->dailyDetailId_item);
---
insert into `daily_details` (`daily_id`, `account_id`, `description`, `debit`, `credit`, `updated_at`, `created_at`) values (12, '1232', '', 150, 0, '2024-05-18 15:17:24', '2024-05-18 15:17:24')

    public function store_group_account()
    {

        // dd($this->core->account_details);
        $daily = new GroupAccount();
        $daily->dailyable()->associate($this->core->account_details);
        $daily->daily_details_id = $this->core->dailyDetailId;
        $daily->save();
---
insert into `group_accounts` (`dailyable_id`, `dailyable_type`, `daily_details_id`, `updated_at`, `created_at`) values (1, 'App\Models\Customer', 32, '2024-05-18 15:17:24', '2024-05-18 15:17:24')