app/Services/DailyPaymentStockService.php

select * from `customers` where `customers`.`id` = '1' limit 1
---
    public function get_customer()
    {

        $this->core->account_details = Customer::find($this->core->data[$this->core->daily_type]['account_details'][$this->core->row_daily_details]);