app/Services/PaymentService.php

        $payment->payment_status = $payment_status;
        $payment->paid = $this->core->data['paid'];
        $payment->remaining = $this->core->data['remaining'];
        $payment->save();
---
insert into `payments` (`paymentable_id`, `paymentable_type`, `payment_info`, `payment_status`, `paid`, `remaining`, `updated_at`, `created_at`) values (4, 'App\Models\Cash', 2, 'pendding', 0, 150, '2024-05-18 15:17:24', '2024-05-18 15:17:24')