app/Services/TreeService.php

    public function get_type_tree($group)
    {



        return collect(DB::table('groups')
            ->join('group_types', 'group_types.id', '=', 'groups.group_type_id')
            ->where('group_types.code', '=',$group)
            ->where('groups.status', '=', 0)
            ->select('groups.account_id')
            ->get())->toArray();
---
select `groups`.`account_id` from `groups` inner join `group_types` on `group_types`.`id` = `groups`.`group_type_id` where `group_types`.`code` = 'supplier' and `groups`.`status` = 0

    public function tree()
    {




        $this->accounts = Cache::rememberForever('tree_accounts', function () {

            return Account::where('parent_id', null)->with('children')->get();
        });
        $this->last_nodes = Cache::rememberForever('tree_accounts_node', function () {

            return Account::where('parent_id', null)->select('accounts.*')->max('id');
        });
---
select * from `accounts` where `accounts`.`parent_id` in (221)

    public function tree_part()
    {


        // dd($this->account[0],$this->last_nodes);

        $this->accounts =  Account::where('id', $this->account[0]->account_id)->with('children')->get();
        $this->last_nodes =  Account::where('id', $this->account[0]->account_id)
            ->select('accounts.*')
            ->max('id');
---
select * from `accounts` where `id` = 221
select max(`id`) as aggregate from `accounts` where `id` = 221