app/Http/Controllers/Leave/LeaveSanctionController.php

    public function get_staff_leave_sanction()
    {

        $staff = StaffSanction::with(['Sanctionable' => function (MorphTo $morphTo) {
            $morphTo->constrain([
                LeaveSanction::class => function ($query) {
                    $query->join('sanction_discounts', 'sanction_discounts.id', '=', 'leave_sanctions.sanction_discount_id');
                    $query->join('leave_types', 'leave_types.id', '=', 'leave_sanctions.leave_type_id');
                    $query->join('parts', 'parts.id', '=', 'leave_sanctions.part_id');
                    $query->select(
                        'leave_sanctions.*',
                        'leave_types.name as type_name',
                        'parts.name as part_name',
                        'sanction_discounts.name as discount_name'
                    );
                },
            ]);
        }])
            ->join('staff', 'staff.id', '=', 'staff_sanctions.staff_id')
            ->where('sanctionable_type', 'App\\Models\\LeaveSanction')
            ->select(
                'staff_sanctions.date as sanction_date',
                'staff_sanctions.sanctionable_type',
                'staff_sanctions.sanctionable_id',
                'staff.name',
                'staff.id',
                'staff_sanctions.status'

            )
            ->paginate();
---
select `leave_sanctions`.*, `leave_types`.`name` as `type_name`, `parts`.`name` as `part_name`, `sanction_discounts`.`name` as `discount_name` from `leave_sanctions` inner join `sanction_discounts` on `sanction_discounts`.`id` = `leave_sanctions`.`sanction_discount_id` inner join `leave_types` on `leave_types`.`id` = `leave_sanctions`.`leave_type_id` inner join `parts` on `parts`.`id` = `leave_sanctions`.`part_id` where `leave_sanctions`.`id` in (13)
select `staff_sanctions`.`date` as `sanction_date`, `staff_sanctions`.`sanctionable_type`, `staff_sanctions`.`sanctionable_id`, `staff`.`name`, `staff`.`id`, `staff_sanctions`.`status` from `staff_sanctions` inner join `staff` on `staff`.`id` = `staff_sanctions`.`staff_id` where `sanctionable_type` = 'App\Models\LeaveSanction' limit 15 offset 0
select count(*) as aggregate from `staff_sanctions` inner join `staff` on `staff`.`id` = `staff_sanctions`.`staff_id` where `sanctionable_type` = 'App\Models\LeaveSanction'