app/Http/Controllers/Leave/LeaveController.php

    public function get_staff_leave()
    {

        //  $minutes = 60;
         $staffs =  DB::table('leaves')
         ->join('leave_types', 'leave_types.id', '=', 'leaves.leave_type_id')
         ->join('parts', 'parts.id', '=', 'leaves.part_id')
         ->join('staff', 'staff.id', '=', 'leaves.staff_id')
         ->select(
             'staff.name as staff_name',
             'staff.id as staff_id',
             'leaves.id as leave_id',
             'leaves.date',
             'parts.name as part_name',
             'leave_types.name as leave_type_name',

             )
         ->paginate();
         // --------------------------------------------------------------------------------------------------

        return response()->json([
            'leave_types'=>LeaveType::all(),
            'leave_parts'=>Part::all(),
            'staffs'=>Staff::all(),
            'list'=>$staffs
        ]);
---
select `staff`.`name` as `staff_name`, `staff`.`id` as `staff_id`, `leaves`.`id` as `leave_id`, `leaves`.`date`, `parts`.`name` as `part_name`, `leave_types`.`name` as `leave_type_name` from `leaves` inner join `leave_types` on `leave_types`.`id` = `leaves`.`leave_type_id` inner join `parts` on `parts`.`id` = `leaves`.`part_id` inner join `staff` on `staff`.`id` = `leaves`.`staff_id` limit 15 offset 0
select count(*) as aggregate from `leaves` inner join `leave_types` on `leave_types`.`id` = `leaves`.`leave_type_id` inner join `parts` on `parts`.`id` = `leaves`.`part_id` inner join `staff` on `staff`.`id` = `leaves`.`staff_id`
select * from `leave_types`
select * from `parts`
select * from `staff`