app/Http/Controllers/Cash/CashController.php

    public function get_all()
    {

        return  StoreProduct::where('store_products.quantity', '!=', '0')
            ->joinall()
            ->select(
                'products.*',
                'products.text as product',
                'stores.text as store',
                'stores.account_id as store_account_id',
                'statuses.name as status',
                'store_products.quantity as availabe_qty',
                'store_products.*',
                'store_products.cost as price',
                'store_products.id as store_product_id'
            )
            ->paginate(100);
---
select `products`.*, `products`.`text` as `product`, `stores`.`text` as `store`, `stores`.`account_id` as `store_account_id`, `statuses`.`name` as `status`, `store_products`.`quantity` as `availabe_qty`, `store_products`.*, `store_products`.`cost` as `price`, `store_products`.`id` as `store_product_id` from `store_products` inner join `products` on `store_products`.`product_id` = `products`.`id` inner join `statuses` on `store_products`.`status_id` = `statuses`.`id` inner join `stores` on `store_products`.`store_id` = `stores`.`id` where `store_products`.`quantity` != '0' limit 100 offset 0
select count(*) as aggregate from `store_products` inner join `products` on `store_products`.`product_id` = `products`.`id` inner join `statuses` on `store_products`.`status_id` = `statuses`.`id` inner join `stores` on `store_products`.`store_id` = `stores`.`id` where `store_products`.`quantity` != '0'

    public function get_one($request)
    {

        $retVal = ($request->type == 'product') ? 'store_products.product_id' : 'store_products.store_id';
        return StoreProduct::where($retVal, $request->id)
            ->where('store_products.quantity', '!=', '0')
            ->joinall()
            ->select(
                'products.*',
                'products.text as product',
                'stores.text as store',
                'stores.account_id as store_account_id',
                'statuses.name as status',
                'store_products.quantity as availabe_qty',
                'store_products.*',
                'store_products.cost as price',
                'store_products.id as store_product_id'
            )
            ->paginate(100);
---
select `products`.*, `products`.`text` as `product`, `stores`.`text` as `store`, `stores`.`account_id` as `store_account_id`, `statuses`.`name` as `status`, `store_products`.`quantity` as `availabe_qty`, `store_products`.*, `store_products`.`cost` as `price`, `store_products`.`id` as `store_product_id` from `store_products` inner join `products` on `store_products`.`product_id` = `products`.`id` inner join `statuses` on `store_products`.`status_id` = `statuses`.`id` inner join `stores` on `store_products`.`store_id` = `stores`.`id` where `store_products`.`product_id` = '51' and `store_products`.`quantity` != '0' limit 100 offset 0
select count(*) as aggregate from `store_products` inner join `products` on `store_products`.`product_id` = `products`.`id` inner join `statuses` on `store_products`.`status_id` = `statuses`.`id` inner join `stores` on `store_products`.`store_id` = `stores`.`id` where `store_products`.`product_id` = '51' and `store_products`.`quantity` != '0'