app/Repository/StaffSaction/StaffAbsenceSanctionRepository.php

    public function update_sanction()
    {



        tap(StaffSanction::where([
            'staff_id' => $this->core->data['staff'],
            'sanctionable_id' => $this->core->data['sanctionable_id'],
            'sanctionable_type' => $this->core->data['sanctionable_type'],
            'date' => $this->core->data['date']


        ]))
            ->update(['status' => $this->core->data['status']])
            ->get('id');
---
select `id` from `staff_sanctions` where (`staff_id` = 48 and `sanctionable_id` = 10 and `sanctionable_type` = 'App\Models\AbsenceSanction' and `date` = '2024-02-01')
update `staff_sanctions` set `status` = 1, `staff_sanctions`.`updated_at` = '2024-03-06 16:08:23' where (`staff_id` = 48 and `sanctionable_id` = 10 and `sanctionable_type` = 'App\Models\AbsenceSanction' and `date` = '2024-02-01')