app/Http/Controllers/Purchase/PurchaseReturnController.php

select `suppliers`.`id`, `suppliers`.`name`, `purchases`.`grand_total` from `purchases` inner join `suppliers` on `suppliers`.`id` = `purchases`.`supplier_id` where `purchases`.`id` = '193'
---
    public function get_purchase($id){

        return DB::table('purchases')
        ->where('purchases.id', $id)
        ->join('suppliers', 'suppliers.id', '=', 'purchases.supplier_id')
        ->select(
            'suppliers.id',
            'suppliers.name',
            'purchases.grand_total',


        )
        ->get();