app/Http/Controllers/Purchase/PurchaseController.php

select `products`.* from `products`
select * from `statuses`
---
    public function index()
    {


        $products = DB::table('products')
            ->select('products.*',)
            ->get();


        return response()->json([
            'products' => $products,
            'suppliers' => $this->suppliers(),
            'statuses' => Status::all(),

select `stores`.`account_id` as `store_account_id`, `stores`.`text` as `store_name`, `stores`.`id` as `store_id` from `stores`
---
    public function get_store()
    {


        return  DB::table('stores')
            ->select(
                'stores.account_id as store_account_id',
                'stores.text as store_name',
                'stores.id as store_id'

            )
            ->get();

select `purchases`.*, `purchases`.`id` as `purchase_id` from `purchases` inner join `suppliers` on `suppliers`.`id` = `purchases`.`supplier_id` where `purchases`.`id` in (106)
---
    public function show()
    {


        $purchases = Payment::with(['Paymentable' => function (MorphTo $morphTo) {
            $morphTo->constrain([
                Purchase::class => function ($query) {
                    $query->join('suppliers', 'suppliers.id', '=', 'purchases.supplier_id');
                    $query->select('purchases.*', 'purchases.id as purchase_id','suppliers.name as supplier_name');
                },
            ]);
        }])
            ->where('paymentable_type', 'App\\Models\\Purchase')
            ->paginate(5);

select `purchases`.*, `purchases`.`id` as `purchase_id` from `purchases` inner join `suppliers` on `suppliers`.`id` = `purchases`.`supplier_id` where `purchases`.`id` in (106)
---
    public function get_purchase($id)
    {




        return Purchase::where('purchases.id', $id)
            ->join('suppliers', 'suppliers.id', '=', 'purchases.supplier_id')
            ->select(
                'purchases.*',
                'purchases.id as purchase_id',
                'purchases.*'
            )
            ->get();