app/Http/Controllers/Purchase/PurchaseController.php

    public function index()
    {


        $products = DB::table('products')
            ->select('products.*',)
            ->get();

        $stores = DB::table('stores')
            ->select(
                'stores.account_id as store_account_id',
                'stores.text as store_name',
                'stores.id as store_id'

            )
            ->get();


        return response()->json([
            'products' => $products,
            // 'suppliers' => $this->suppliers(),
            'statuses' => Status::all(),
            // 'treasuries' => $this->treasuries(),
            'stores' => $stores

        ]);
---
select `suppliers`.* from `suppliers`
select * from `statuses`