app/Http/Controllers/Sale/SaleController.php

    public function show()
    {


        $sales = Payment::with(['Paymentable' => function (MorphTo $morphTo) {
            $morphTo->constrain([
                Sale::class => function ($query) {

                    $query->join('customers', 'customers.id', '=', 'sales.customer_id');
                    $query->select('sales.*', 'sales.id as sale_id', 'customers.name as customer_name');
                },
            ]);
        }])
            ->where('paymentable_type', 'App\\Models\\Sale')
            ->paginate(5);
---
select `sales`.*, `sales`.`id` as `sale_id`, `customers`.`name` as `customer_name` from `sales` inner join `customers` on `customers`.`id` = `sales`.`customer_id` where `sales`.`id` in (62)