app/Traits/Cash/CashTrait.php

insert into `cashes` (`customer_id`, `customer_name`, `grand_total`, `date`, `updated_at`, `created_at`) values (1, 'الخليل احمد عبدالجليل', 150, '2024-05-18', '2024-05-18 15:17:24', '2024-05-18 15:17:24')
---
    public function add_into_cash_table()
    {




        $table_one = Cash::create(
            [
                'customer_id' => (array_key_exists('customer_id',$this->core->data)) ? $this->core->data['customer_id'] : null,
                'customer_name' => (array_key_exists('customer_name',$this->core->data)) ? $this->core->data['customer_name'] : null,
                'grand_total' => $this->core->data['grand_total'],
                'date' => $this->core->data['date'],

            ]
        );

update `cashes` set `daily_id` = 12 where (`id` = 4)
---
    public function refresh_cash_table()
    {


        DB::table('cashes')
            ->where(['id' => $this->core->cash_id])
            ->update(['daily_id' => $this->core->daily_id]);