app/Http/Controllers/Staff/AdvanceController.php

    public function index()
    {


        $advances = Staff::with(['advance'])->paginate(10);

        $this->hr->Sum($advances, 'advance');
        // ------------------------------------------------------------------------------------------------
        $staffs =  DB::table('staff')
            ->select(
                'staff.name',
                'staff.id',
            )
            ->get();


        // -------------------------------------------------------------------------------------------------

        return response()->json([

            'staffs' => $staffs,
            'list' => $advances,
            'debit'=>HrAccount::where('code','advance')->select('account_id','id as hr_account_id')->get(),
---
select * from `advances` where `advances`.`staff_id` in (48, 49)
select * from `staff` limit 10 offset 0
select count(*) as aggregate from `staff`
select `staff`.`name`, `staff`.`id` from `staff`
select `account_id`, `id` as `hr_account_id` from `hr_accounts` where `code` = 'advance'