app/Http/Controllers/Staff/AllowanceController.php

select * from `allowance_types`
---
    public function index()
    {



        return response()->json([
            'allowance_types' => AllowanceType::all(),
            'staffs' => $this->get_staff(),
            'list' =>$this->get_staff_allowance()
        ]);