app/Http/Controllers/Staff/AllowanceController.php

select * from `hr_accounts` where `type` = 'allowance'
---
    public function index()
    {



        return response()->json([
            'allowance_types' => AllowanceType::all(),
            'accounts'=>DB::table('hr_accounts')->where('type','allowance')->select('*')->get(),

select `staff`.`name`, `staff`.`id` from `staff`
---
    public function get_staff()
    {

        $staffs =  DB::table('staff')
            ->select(
                'staff.name',
                'staff.id',
            )
            ->get();