app/Http/Controllers/Staff/SalaryController.php

select `payrolls`.*, `staff`.* from `staff` inner join `payrolls` on `payrolls`.`staff_id` = `staff`.`id` limit 100 offset 0
select count(*) as aggregate from `staff` inner join `payrolls` on `payrolls`.`staff_id` = `staff`.`id`
---
    public function salary_details(Request $request)
    {


        $salaries = DB::table('staff')->where('staff.id', $request->id)
            ->join('payrolls', 'payrolls.staff_id', '=', 'staff.id')
            // ->join('allowances', 'allowances.staff_id', '=', 'staff.id')
            // ->join('allowance_types', 'allowance_types.id', '=', 'allowances.allowance_type_id')
            ->select(
                'payrolls.*',
                'staff.*'
                // 'allowance_types.name as type_name','allowances.quantity as quantity_allowance'
            )
            ->paginate(100);