app/Http/Controllers/Staff/StaffController.php

select `periods`.*, `periods`.`id` as `period_id`, `period_times`.*, `period_times`.`id` as `period_time_id` from `period_times` inner join `periods` on `periods`.`id` = `period_times`.`period_id`
---

        // dd($staff_list);

        $period_times = PeriodTime::join('periods', 'periods.id', '=', 'period_times.period_id')
        ->select(
            'periods.*',
            'periods.id as period_id',
            'period_times.*',
            'period_times.id as period_time_id',
        )
        ->get();

select * from `qualifications`
select * from `nationalities`
select * from `staff_types`
select * from `staff_religions`
select * from `branches`
select * from `work_systems`
---

        return response()->json([

            'qualifications' => Qualification::all(),
            'nationalities' => Nationality::all(),
            'staff_types' => StaffType::all(),
            'staff_religions' => StaffReligion::all(),
            'list' => $staff_list,
            'branches' => Branch::all(),
            'staffs' => $this->get_staff(),
            'work_systems' =>WorkSystem::all(),