app/Http/Controllers/Delay/DelaySanctionController.php

select `staff_sanctions`.`date` as `sanction_date`, `staff_sanctions`.`sanctionable_type`, `staff_sanctions`.`sanctionable_id`, `staff`.`name`, `staff`.`id`, `staff_sanctions`.`status` from `staff_sanctions` inner join `staff` on `staff`.`id` = `staff_sanctions`.`staff_id` where `sanctionable_type` = 'App\Models\DelaySanction' limit 15 offset 0
select count(*) as aggregate from `staff_sanctions` inner join `staff` on `staff`.`id` = `staff_sanctions`.`staff_id` where `sanctionable_type` = 'App\Models\DelaySanction'
---
    public function get_staff_delay_sanction(Request $request)
    {


        $staff = StaffSanction::with(['Sanctionable' => function (MorphTo $morphTo) {
            $morphTo->constrain([
                DelaySanction::class => function ($query) {
                    $query->join('sanction_discounts', 'sanction_discounts.id', '=', 'delay_sanctions.sanction_discount_id');
                    $query->join('delay_types', 'delay_types.id', '=', 'delay_sanctions.delay_type_id');
                    $query->join('parts', 'parts.id', '=', 'delay_sanctions.part_id');
                    $query->select(
                        'delay_sanctions.*',
                        'delay_types.name as type_name',
                        'parts.name as part_name',
                        'sanction_discounts.name as discount_name'
                    );
                },
            ]);
        }])
                ->join('staff', 'staff.id', '=', 'staff_sanctions.staff_id')


            ->where('sanctionable_type', 'App\\Models\\DelaySanction')
            ->select(
                'staff_sanctions.date as sanction_date',
                'staff_sanctions.sanctionable_type',
                'staff_sanctions.sanctionable_id',
                'staff.name',
                'staff.id',
                'staff_sanctions.status'

            )
            ->paginate();