app/Http/Controllers/Supply/SupplyController.php

select `products`.* from `products`
select `stores`.`account_id` as `store_account_id`, `stores`.`text` as `store_name`, `stores`.`id` as `store_id` from `stores`
select * from `statuses`
---
    public function index()
    {


        $products = DB::table('products')
            ->select('products.*',)
            ->get();

        $stores = DB::table('stores')
            ->select(
                'stores.account_id as store_account_id',
                'stores.text as store_name',
                'stores.id as store_id'

            )
            ->get();


        return response()->json([
            'products' => $products,
            'suppliers' => $this->suppliers(),
            'statuses' => Status::all(),
            // 'treasuries' => $this->treasuries(),
            'stores' => $stores

        ]);

select `supplies`.*, `supplies`.`id` as `supply_id` from `supplies` inner join `suppliers` on `suppliers`.`id` = `supplies`.`supplier_id` where `supplies`.`id` in (7)
---
    public function supply_list()
    {


        $supplies = Payment::with(['Paymentable' => function (MorphTo $morphTo) {
            $morphTo->constrain([
                Supply::class => function ($query) {

                    $query->join('suppliers', 'suppliers.id', '=', 'supplies.supplier_id');


                    $query->select(
                        'supplies.*',
                        'supplies.id as supply_id',

                    );
                },
            ]);
        }])
            ->where('paymentable_type', 'App\\Models\\Supply')
            ->paginate(5);