app/Http/Controllers/Supply/SupplyController.php

    public function suppliers()
    {

        $suppliers =  DB::table('suppliers')
            ->join('accounts', 'suppliers.account_id', '=', 'accounts.id')
            ->select(
                'suppliers.*',

            )
            ->get();
---
select `suppliers`.* from `suppliers`