app/Http/Controllers/Extra/ExtraController.php

    public function index()
    {


        $extras = staff::with(['extra', 'extra.extra_type'])->paginate(10);
        $this->hr->Sum($extras, 'extra');

        // dd($extras);
        $staffs = Cache::rememberForever('staff', function () {
            return DB::table('staff')->get();
        });

        return response()->json([
            'extra_types' => ExtraType::all(),
            // 'extra_parts' => ExtraPart::all(),
            'staffs' => Staff::all(),
            'list' => $extras
        ]);
---
select * from `extras` where `extras`.`staff_id` in (48, 49)
select * from `staff` limit 10 offset 0
select * from `extra_types`
select * from `staff`