app/Http/Controllers/Extra/ExtraSanctionController.php

select * from `extra_types`
select * from `sanction_discounts`
select * from `parts`
---
    public function index()
    {


        $staffs = Cache::rememberForever('staff', function () {
            return DB::table('staff')->get();
        });

        return response()->json([
            'list' => $this->get_extra_sanction(),
            'extra_types' => ExtraType::all(),
            'staffs' => $staffs,
            'discount_types' => SanctionDiscount::all(),
            'extra_parts' => Part::all()

select count(*) as aggregate from `extra_sanctions` inner join `extra_types` on `extra_types`.`id` = `extra_sanctions`.`extra_type_id` inner join `parts` on `parts`.`id` = `extra_sanctions`.`part_id` inner join `sanction_discounts` on `sanction_discounts`.`id` = `extra_sanctions`.`sanction_discount_id`
---
    public function get_extra_sanction()
    {

        $extra_sanctions =  DB::table('extra_sanctions')
            ->join('extra_types', 'extra_types.id', '=', 'extra_sanctions.extra_type_id')
            ->join('parts', 'parts.id', '=', 'extra_sanctions.part_id')
            ->join('sanction_discounts', 'sanction_discounts.id', '=', 'extra_sanctions.sanction_discount_id')
            ->select('extra_sanctions.*', 'parts.name as duration', 'extra_types.name as extra', 'sanction_discounts.name as discount_name')
            ->paginate(10);

select `extra_sanctions`.*, `parts`.`name` as `part_name`, `extra_types`.`name` as `type_name`, `sanction_discounts`.`name` as `discount_name` from `extra_sanctions` inner join `sanction_discounts` on `sanction_discounts`.`id` = `extra_sanctions`.`sanction_discount_id` inner join `extra_types` on `extra_types`.`id` = `extra_sanctions`.`extra_type_id` inner join `parts` on `parts`.`id` = `extra_sanctions`.`part_id` where `extra_sanctions`.`id` in (20, 21)
select `staff_sanctions`.`date` as `sanction_date`, `staff_sanctions`.`sanctionable_type`, `staff_sanctions`.`sanctionable_id`, `staff`.`name`, `staff`.`id`, `staff_sanctions`.`status` from `staff_sanctions` inner join `staff` on `staff`.`id` = `staff_sanctions`.`staff_id` where `sanctionable_type` = 'App\Models\ExtraSanction' limit 15 offset 0
select count(*) as aggregate from `staff_sanctions` inner join `staff` on `staff`.`id` = `staff_sanctions`.`staff_id` where `sanctionable_type` = 'App\Models\ExtraSanction'
---
    public function get_staff_extra_sanction(Request $request)
    {

        $staff = StaffSanction::with(['Sanctionable' => function (MorphTo $morphTo) {
            $morphTo->constrain([
                ExtraSanction::class => function ($query) {
                    $query->join('sanction_discounts', 'sanction_discounts.id', '=', 'extra_sanctions.sanction_discount_id');
                    $query->join('extra_types', 'extra_types.id', '=', 'extra_sanctions.extra_type_id');
                    $query->join('parts', 'parts.id', '=', 'extra_sanctions.part_id');
                    $query->select(
                        'extra_sanctions.*',
                        'parts.name as part_name',
                        'extra_types.name as type_name',
                        'sanction_discounts.name as discount_name'
                    );
                },
            ]);
        }])
            ->join('staff', 'staff.id', '=', 'staff_sanctions.staff_id')
            ->where('sanctionable_type', 'App\\Models\\ExtraSanction')
            ->select(
                'staff_sanctions.date as sanction_date',
                'staff_sanctions.sanctionable_type',
                'staff_sanctions.sanctionable_id',
                'staff.name',
                'staff.id',
                'staff_sanctions.status'


            )
            ->paginate();