app/Traits/Unit/UnitsTrait.php

    public function units()
    {



            $this->value->units = DB::table('product_units')
                ->join('units', 'units.id', '=', 'product_units.unit_id')
                ->join('products', 'products.id', '=', 'product_units.product_id')
                ->where('product_units.product_id', $this->value->product_id)
                ->select('units.*', 'product_units.*')
                ->get();
---
select `units`.*, `products`.`rate`, `product_units`.`unit_type` from `product_units` inner join `units` on `units`.`id` = `product_units`.`unit_id` inner join `products` on `products`.`id` = `product_units`.`product_id` where `product_units`.`product_id` = 421