app/Http/Controllers/Account/AccountController.php

    public function get_group_accounts_details_details(Request $request)
    {


        $groups = DB::table('groups')
            ->where('groups.account_id', $request->id)
            ->join('group_types', 'group_types.id', '=', 'groups.group_type_id')
            ->select('groups.id', 'group_types.code')
            ->get();
            // dd(123);

        foreach ($groups as $key => $value) {

            // dd($value->code);
            if ($value->code == 'customer') {

                $data = Customer::where('customers.group_id', $value->id)
                    ->select('customers.*')
                    ->get();
                $type = $value->code;
            }

            if ($value->code == 'supplier') {

                $data = Supplier::where('suppliers.group_id', $value->id)
                    ->select('suppliers.*')
                    ->get();
---
select `groups`.`id`, `group_types`.`code` from `groups` inner join `group_types` on `group_types`.`id` = `groups`.`group_type_id` where `groups`.`account_id` = '2212'
select `customers`.* from `customers` where `customers`.`group_id` = 1
select `suppliers`.* from `suppliers` where `suppliers`.`group_id` = 4


            if ($value->code == 'treasury') {

                $data = Treasury::where('treasuries.group_id', $value->id)
                    ->select('treasuries.*')
                    ->get();
---
select `treasuries`.* from `treasuries` where `treasuries`.`group_id` = 6

    public function get_account(Request $request)
    {

        $accounts = DB::table('stores')->where('stores.id', $request->id)
            ->join('accounts', 'stores.account_id', '=', 'accounts.id')
            ->select('accounts.id', 'accounts.text')
            ->get();
---
select `accounts`.`id`, `accounts`.`text` from `stores` inner join `accounts` on `stores`.`account_id` = `accounts`.`id` where `stores`.`id` = '121'