app/Http/Controllers/Account/AccountController.php

select `accounts`.*, (select SUM(credit) from `daily_details` where `account_id` = `accounts`.`id`) as `credit`, (select SUM(debit) from `daily_details` where `account_id` = `accounts`.`id`) as `debit`, (select SUM(credit)-SUM(debit) from `daily_details` where `account_id` = `accounts`.`id`) as `balance` from `accounts` where `accounts`.`status_account` = 'false'
---
    public function auditBalance()
    {

        $sum_debit = 0;
        $sum_credit = 0;
        $auditBalances = Account::where('accounts.status_account', '=', 'false')
            ->addSelect([
                'credit' => DailyDetail::select(DB::Raw('SUM(credit)'))
                    ->whereColumn('account_id', 'accounts.id'),
                'debit' => DailyDetail::select(DB::Raw('SUM(debit)'))
                    ->whereColumn('account_id', 'accounts.id'),
                'balance' => DailyDetail::select(DB::raw('SUM(credit)-SUM(debit)'))
                    ->whereColumn('account_id', 'accounts.id')
            ])
            ->get();